# SlabShapeCrease Class

---
Represents a crease of a slab shape edited element.
SystemObject Autodesk.Revit.DBSlabShapeCrease
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class SlabShapeCrease : IDisposable

    Public Class SlabShapeCrease
    	Implements IDisposable

    public ref class SlabShapeCrease : IDisposable

    type SlabShapeCrease =
        class
            interface IDisposable
        end
The SlabShapeCrease type exposes the following members.
| Name| Description
---|---|---
| CreaseType|  The type of the crease.
| Curve| The geometry of the crease.
| EndPoints| The vertices of the crease.
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the SlabShapeCrease
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB Namespace